garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1765.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM1PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM1PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x113">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1PCH" edc:desc="" edc:mask="0xf" edc:name="C1PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH2" edc:desc="" edc:mask="0x1" edc:name="C1PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH3" edc:desc="" edc:mask="0x1" edc:name="C1PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nnrnn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00100" edc:name="CM2CON0" edc:nzwidth="8" edc:por="00-00100" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x114">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Reserved" edc:desc="" edc:mask="0x1" edc:name="Reserved" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2SP" edc:desc="" edc:mask="0x1" edc:name="C2SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2ZLF" edc:desc="" edc:mask="0x1" edc:name="C2ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM2CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM2CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x115">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM2NSEL" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM2NSEL" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x116">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH" edc:desc="" edc:mask="0x7" edc:name="C2NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH2" edc:desc="" edc:mask="0x1" edc:name="C2NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM2PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM2PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="" edc:mask="0xf" edc:name="C2PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH2" edc:desc="" edc:mask="0x1" edc:name="C2PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH3" edc:desc="" edc:mask="0x1" edc:name="C2PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x180"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="---1-111" edc:_addr="0x18C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x18D"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="ANSELC" edc:nzwidth="8" edc:por="----1111" edc:_addr="0x18E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSC0" edc:desc="" edc:mask="0x1" edc:name="ANSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC1" edc:desc="" edc:mask="0x1" edc:name="ANSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x18F"/>
        <edc:JoinedSFRDef edc:cname="PMADR" edc:desc="" edc:name="PMADR" edc:nzwidth="0x10" edc:_addr="0x191">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x191">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="1nnnnnnn" edc:cname="PMADRH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0x192">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:mask="0x7f" edc:name="PMADRH" edc:nzwidth="7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMDAT" edc:desc="" edc:name="PMDAT" edc:nzwidth="0x10" edc:_addr="0x193">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x193">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0x194">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="1nnnnnss" edc:cname="PMCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1000q000" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="1000x000" edc:_addr="0x195">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="Read Control bit" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="Write Control bit" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="Program/Erase Enable bit" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="Sequence Error Flag bit" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="Program FLASH Erase Enable bit" edc:mask="0x1" edc:name="FREE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LWLO" edc:desc="Load Write Latches Only bit" edc:mask="0x1" edc:name="LWLO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="FLASH Program / Data EEPROM or Configuration Select bit" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="PMCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMCON2" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x196">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMCON2" edc:desc="" edc:mask="0xff" edc:name="PMCON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x197"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RC1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RC1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x199">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCREG"/>
            <edc:LegacyAlias edc:cname="RCREG1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1REG" edc:desc="" edc:mask="0xff" edc:name="RC1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TX1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TX1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXREG1"/>
            <edc:LegacyAlias edc:cname="TXREG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX1REG" edc:desc="" edc:mask="0xff" edc:name="TX1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SP1BRG" edc:desc="" edc:name="SP1BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SP1BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SP1BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19B">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="SPBRG1"/>
              <edc:LegacyAlias edc:cname="SPBRGL"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SP1BRGL" edc:desc="" edc:mask="0xff" edc:name="SP1BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
