garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1765.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="COG1FSIM1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="COG1FSIM1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM8" edc:desc="" edc:mask="0x1" edc:name="FSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM9" edc:desc="" edc:mask="0x1" edc:name="FSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM10" edc:desc="" edc:mask="0x1" edc:name="FSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM11" edc:desc="" edc:mask="0x1" edc:name="FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM12" edc:desc="" edc:mask="0x1" edc:name="FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM13" edc:desc="" edc:mask="0x1" edc:name="FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM14" edc:desc="" edc:mask="0x1" edc:name="FSIM14" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1FSIM8" edc:desc="" edc:mask="0x1" edc:name="G1FSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM9" edc:desc="" edc:mask="0x1" edc:name="G1FSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM10" edc:desc="" edc:mask="0x1" edc:name="G1FSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM11" edc:desc="" edc:mask="0x1" edc:name="G1FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM12" edc:desc="" edc:mask="0x1" edc:name="G1FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM13" edc:desc="" edc:mask="0x1" edc:name="G1FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FSIM14" edc:desc="" edc:mask="0x1" edc:name="G1FSIM14" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="COG1ASD0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0x0101--" edc:name="COG1ASD0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC" edc:desc="" edc:mask="0x3" edc:name="ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASDBD" edc:desc="" edc:mask="0x3" edc:name="ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASREN" edc:desc="" edc:mask="0x1" edc:name="ASREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASE" edc:desc="" edc:mask="0x1" edc:name="ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC0" edc:desc="" edc:mask="0x1" edc:name="ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDAC1" edc:desc="" edc:mask="0x1" edc:name="ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD0" edc:desc="" edc:mask="0x1" edc:name="ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD1" edc:desc="" edc:mask="0x1" edc:name="ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARSEN" edc:desc="" edc:mask="0x1" edc:name="ARSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC" edc:desc="" edc:mask="0x3" edc:name="G1ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD" edc:desc="" edc:mask="0x3" edc:name="G1ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ARSEN" edc:desc="" edc:mask="0x1" edc:name="G1ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASE" edc:desc="" edc:mask="0x1" edc:name="G1ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC0" edc:desc="" edc:mask="0x1" edc:name="G1ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDAC1" edc:desc="" edc:mask="0x1" edc:name="G1ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD0" edc:desc="" edc:mask="0x1" edc:name="G1ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDBD1" edc:desc="" edc:mask="0x1" edc:name="G1ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASREN" edc:desc="" edc:mask="0x1" edc:name="G1ASREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1ASD1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1ASD1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:desc="" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:desc="" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:desc="" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:desc="" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1AS0E" edc:desc="" edc:mask="0x1" edc:name="G1AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS1E" edc:desc="" edc:mask="0x1" edc:name="G1AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS2E" edc:desc="" edc:mask="0x1" edc:name="G1AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS3E" edc:desc="" edc:mask="0x1" edc:name="G1AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS4E" edc:desc="" edc:mask="0x1" edc:name="G1AS4E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS5E" edc:desc="" edc:mask="0x1" edc:name="G1AS5E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS6E" edc:desc="" edc:mask="0x1" edc:name="G1AS6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1AS7E" edc:desc="" edc:mask="0x1" edc:name="G1AS7E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x69F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATA" edc:desc="" edc:mask="0x1" edc:name="SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATB" edc:desc="" edc:mask="0x1" edc:name="SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATC" edc:desc="" edc:mask="0x1" edc:name="SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATD" edc:desc="" edc:mask="0x1" edc:name="SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1STRA" edc:desc="" edc:mask="0x1" edc:name="G1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRB" edc:desc="" edc:mask="0x1" edc:name="G1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRC" edc:desc="" edc:mask="0x1" edc:name="G1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1STRD" edc:desc="" edc:mask="0x1" edc:name="G1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATA" edc:desc="" edc:mask="0x1" edc:name="G1SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATB" edc:desc="" edc:mask="0x1" edc:name="G1SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATC" edc:desc="" edc:mask="0x1" edc:name="G1SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1SDATD" edc:desc="" edc:mask="0x1" edc:name="G1SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
        <edc:AdjustPoint edc:offset="8" edc:_addr="0x78C"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG1RTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG1RTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x794">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSS" edc:desc="" edc:mask="0xf" edc:name="RTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RTSS0" edc:desc="" edc:mask="0x1" edc:name="RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS1" edc:desc="" edc:mask="0x1" edc:name="RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS2" edc:desc="" edc:mask="0x1" edc:name="RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS3" edc:desc="" edc:mask="0x1" edc:name="RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1RTSS0" edc:desc="" edc:mask="0x1" edc:name="RG1RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1RTSS1" edc:desc="" edc:mask="0x1" edc:name="RG1RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1RTSS2" edc:desc="" edc:mask="0x1" edc:name="RG1RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1RTSS3" edc:desc="" edc:mask="0x1" edc:name="RG1RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG1FTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG1FTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x795">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FTSS" edc:desc="" edc:mask="0xf" edc:name="FTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="FTSS0" edc:desc="" edc:mask="0x1" edc:name="FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS1" edc:desc="" edc:mask="0x1" edc:name="FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS2" edc:desc="" edc:mask="0x1" edc:name="FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS3" edc:desc="" edc:mask="0x1" edc:name="FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1FTSS0" edc:desc="" edc:mask="0x1" edc:name="RG1FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1FTSS1" edc:desc="" edc:mask="0x1" edc:name="RG1FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1FTSS2" edc:desc="" edc:mask="0x1" edc:name="RG1FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1FTSS3" edc:desc="" edc:mask="0x1" edc:name="RG1FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
