garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1765.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG1INS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG1INS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x796">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INS" edc:desc="" edc:mask="0xf" edc:name="INS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="INS0" edc:desc="" edc:mask="0x1" edc:name="INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS1" edc:desc="" edc:mask="0x1" edc:name="INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS2" edc:desc="" edc:mask="0x1" edc:name="INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS3" edc:desc="" edc:mask="0x1" edc:name="INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1INS0" edc:desc="" edc:mask="0x1" edc:name="RG1INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1INS1" edc:desc="" edc:mask="0x1" edc:name="RG1INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1INS2" edc:desc="" edc:mask="0x1" edc:name="RG1INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1INS3" edc:desc="" edc:mask="0x1" edc:name="RG1INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PRG1CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PRG1CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x797">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OS" edc:desc="" edc:mask="0x1" edc:name="OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REDG" edc:desc="" edc:mask="0x1" edc:name="REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FEDG" edc:desc="" edc:mask="0x1" edc:name="FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1GO" edc:desc="" edc:mask="0x1" edc:name="RG1GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1OS" edc:desc="" edc:mask="0x1" edc:name="RG1OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1MODE" edc:desc="" edc:mask="0x3" edc:name="RG1MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RG1REDG" edc:desc="" edc:mask="0x1" edc:name="RG1REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1FEDG" edc:desc="" edc:mask="0x1" edc:name="RG1FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG1EN" edc:desc="" edc:mask="0x1" edc:name="RG1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG1MODE0" edc:desc="" edc:mask="0x1" edc:name="RG1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1MODE1" edc:desc="" edc:mask="0x1" edc:name="RG1MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----rnn" edc:cname="PRG1CON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PRG1CON1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x798">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPOL" edc:desc="" edc:mask="0x1" edc:name="RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FPOL" edc:desc="" edc:mask="0x1" edc:name="FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG1RPOL" edc:desc="" edc:mask="0x1" edc:name="RG1RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1FPOL" edc:desc="" edc:mask="0x1" edc:name="RG1FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG1RDY" edc:desc="" edc:mask="0x1" edc:name="RG1RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
